app/views/projet/index.html.erb

SELECT "projects".* FROM "projects"
SELECT COUNT(*) FROM "projects"
---
<h1>Tous les projets MédiaCarré <BR/>
  <small>Nombre de projets enregistrés :<%= Project.all.count %></small>

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", nil]]
---
</td>
<td><%= Client.find(projet.client_id).entreprise %></td>