app/views/projet/new.html.erb


<% if Project.where(client_id: params[:id]).exists? %>
---
SELECT  1 AS one FROM "projects" WHERE "projects"."client_id" = ? LIMIT 1  [["client_id", 2]]
SELECT "projects".* FROM "projects" WHERE "projects"."client_id" = ?  [["client_id", 4]]