app/views/projet/show.html.erb

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 2]]
---

<h1>Fiche projet de monsieur <%= Client.find(params[:id]).nom %>