app/views/home/index.html.erb

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 2]]
---
</td>
<td><%= Client.find(projet.client_id).entreprise %></td>

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 4]]
---

         <% if Project.find(projet.id).client.contrat_type == "Création simple" %>

SELECT  "projects".* FROM "projects"  ORDER BY "projects"."id" DESC LIMIT 1
---
                                  <span class="label label-default">Chiffre d'affaire : </span>
                                  <span class="label label-success"><%= Project.sum(:tarif) %> €</span>