app/controllers/home_controller.rb

SELECT  "clients".* FROM "clients"  ORDER BY "clients"."id" DESC LIMIT 1
SELECT  "projects".* FROM "projects"  ORDER BY "projects"."id" DESC LIMIT 1
---
  def index
    @clients = Client.all
    @var_id = Client.last.id + 1
    @projets = Project.order(:date)
    @tarifs= Project.where.not(tarif: nil)

INSERT INTO "clients" ("nom", "email", "prenom", "entreprise", "rue", "ville", "tel", "description", "contrat_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
   def clients
  @back_url = session[:my_previous_url]
  @creer = Client.create nom: params[:nom], email: params[:email], prenom: params[:prenom], entreprise: params[:entreprise], rue: params[:rue], ville: params[:ville], tel: params[:tel], avatar: params[:avatar], description: params[:description], contrat_type: params[:contrat_type]

SELECT  "clients".* FROM "clients"  ORDER BY "clients"."id" DESC LIMIT 1
---
  def creation
     @var_id = Client.last.id + 1

SELECT "projects".* FROM "projects" WHERE "projects"."client_id" = ?  [["client_id", 2]]
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @projets = Project.where(client_id: params[:id])
    @client = Client.find(params[:id])

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "clients" SET "avatar_file_name" = ?, "avatar_content_type" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ? WHERE "clients"."id" = ?  [["avatar_file_name", "julien-carre5.jpg"], ["avatar_content_type", "image/jpeg"], ["avatar_file_size", 291305], ["avatar_updated_at", "2015-12-28 12:39:19.005372"], ["id", 2]]
---
def update
    @client = Client.find(params[:id])
    if @client.update_attributes(user_params)

DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 1]]
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 1]]
---
  def destroy
    Client.find(params[:id]).destroy

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 2]]
---
def set_book
 @set = Client.find(params[:id])