app/controllers/projet_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
     @projets = Project.all

SELECT "projects".* FROM "projects" WHERE "projects"."client_id" = ?  [["client_id", 2]]
---
  def show
@projects = Project.where( client_id: params[:id])

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 2]]
SELECT "projects".* FROM "projects"
---
  def new
 @date = Date.today
 @client= Client.find(params[:id])
 @projets = Project.all

INSERT INTO "projects" ("domaine", "site_type", "multilingue", "avancé", "techno_type", "description", "client_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["domaine", "juju.com"], ["site_type", ""], ["multilingue", "Français seulement"], ["avancé", 1], ["techno_type", ""], ["description", "                            "], ["client_id", 4]]
---
def create
@date = Date.today
@creer_project = Project.create date: @date, domaine: params[:domaine], site_type: params[:site_type], multilingue: params[:multilingue], avance: params[:avance], techno_type: params[:techno_type], description: params[:description], client_id: params[:id]